//
//  BBMaterial.swift
//  BrainBot
//
//  Created by KazuyaIkoma on 2018/12/31.
//  Copyright © 2018 kaz. All rights reserved.
//

import Foundation

struct BBMaterial {
    // IdeaVC用の質問文
    // TODO: 文言の修正
    static let hints: [String] = [
        "色を変えたらどうなる？",
        "同質にしたらどうなる？",
        "温度や柔軟性を変えたらどうなる？"
    ]
    
//    static let hints: [String] = [
//        "色を変えたらどうなる？",
//        "同質にしたらどうなる？",
//        "温度や柔軟性を変えたらどうなる？",
//        "色を変えたらどうなる？1",
//        "色を変えたらどうなる？2",
//        "色を変えたらどうなる？3",
//        "色を変えたらどうなる？4",
//        "色を変えたらどうなる？5",
//        "色を変えたらどうなる？6",
//        "色を変えたらどうなる？7",
//        "色を変えたらどうなる？8",
//        "色を変えたらどうなる？9",
//        "色を変えたらどうなる？10",
//        "色を変えたらどうなる？11",
//        "色を変えたらどうなる？12",
//        "色を変えたらどうなる？13",
//        "色を変えたらどうなる？14",
//        "色を変えたらどうなる？15",
//        "色を変えたらどうなる？16",
//        "色を変えたらどうなる？17",
//        "色を変えたらどうなる？18",
//        "色を変えたらどうなる？19",
//        "色を変えたらどうなる？20",
//        "色を変えたらどうなる？a",
//        "色を変えたらどうなる？b",
//        "色を変えたらどうなる？c",
//        "色を変えたらどうなる？d",
//        "色を変えたらどうなる？e",
//        "色を変えたらどうなる？f",
//        "色を変えたらどうなる？g",
//        "色を変えたらどうなる？h",
//        "色を変えたらどうなる？i",
//        "色を変えたらどうなる？j",
//        "色を変えたらどうなる？k",
//        "色を変えたらどうなる？s1",
//        "色を変えたらどうなる？a2",
//        "色を変えたらどうなる？a3",
//        "色を変えたらどうなる？a4",
//        "色を変えたらどうなる？aa",
//        "色を変えたらどうなる？bb"
//    ]
}
