//
//  BBMaterial.swift
//  BrainBot
//
//  Created by KazuyaIkoma on 2018/12/31.
//  Copyright © 2018 kaz. All rights reserved.
//

import Foundation

struct BBMaterial {
    // IdeaVC用の質問文
    // TODO: 文言の修正
    static let hints: [String] = [
        "それを極限まで分解したらどうなる？",
        "余計なものを省いたり、それを別の場所に移したらどうなる？",
        "一部の機能やカタチ、材料を変えるとどうなる？",
        "あえてバランスを崩したらどうなる？",
        "何か2つ以上を組み合わせてみたらどうなる？",
        "多機能にしたり、他の目的に使おうとしたらどうなる？",
        "入れ子構造にしたらどうなる？",
        "うまくバランスを取ったらどうなる？",
        "なにか問題が起こる前に対策を取ろうとしたらどうなる？",
        "予約タイマーなど、あらかじめ何かを待たせるようにしたらどうなる？",
        "エアバッグなど、最悪の事態に備えようとしたらどうなる？",
        "何かを平等に負担したらどうなる？",
        "手順や並びを、これまでと逆にしたらどうなる？",
        "立体にしたり、回転させたらどうなる？",
        "どんな環境にも適応できるようにしたらどうなる？",
        "完璧主義を捨てたらどうなる？",
        "点を、直線や二次元、立体にしたらどうなる？",
        "一定の動きやリズムを取り入れたらどうなる？",
        "同じ動作やプロセスを繰り返したらどうなる？",
        "動きを高速にしたらどうなる？",
        "予防接種に本来毒であるワクチンを使うなど、マイナスを利用してプラスにできないか？",
        "結果を見直ため、フィードバックするようにしたらどうなる？",
        "直接扱うのではなく、何かの仲介役にさせたらどうなる？",
        "自動的に動くようにしたらどうなる？",
        "コピーしたり代用しようとしたらどうなる？",
        "使い捨てにしたらどうなる？",
        "色や透明度を変えたらどうなる？",
        "自動で排除したり、再生させたりしたらどうなる？",
        "材料同士を混ぜたらどうなる？",
        "当然あるべきはずのものが無くなったらどうなる？",
        "愉快な気分だったり怒っていたり、いつもと違う気持ちだったらどうなる？",
        "座ったり喋ったりしながらなど、いつもと違う行動を取るとどうなる？",
        "子供や外国人など、別の人だったらどう感じる？",
    ]
}
